Repository: ericonr/purr-c
Catalog: po/*.po
Languages: pt_br

source: Usage: gemi [options] <url> Options: -b: browse mode (experimental) -p: use pager: value of PAGER (default is less) -s: don't check server name -a: accept server's public key -n: don't strip header -d: debug -h: show this dialog -r: number of redirections (internal use) Environment:
pt_br: Forma de uso: gemi [opções] <url> Opçõess: -b: modo navegador (experimental) -p: utilizar paginador: valor de PAGER (padrão é o programa less) -s: não verificar nome do servidor -a: aceitar chave pública do servidor -n: não esconder cabeçalho -d: rodar em modo de debug -h: mostrar essa mensagem -r: quantidade de redirecionamentos (uso interno) Ambiente:

source: this isn't a gemini url!
pt_br: isso não é um endereço gemini!

source: error: truncated request!
pt_br: erro: o pedido foi truncado!

source: request: %s
pt_br: pedido: %s

source: bearssl_read_certs(): couldn't read certs!
pt_br: bearssl_read_certs(): não foi possível ler os certificados!

source: HOME is too long!
pt_br: HOME é longo demais!

source: error reading cert file: '%s'
pt_br: erro ao ler o arquivo de certificado: '%s'

source: null public key
pt_br: chave pública nula

source: keytype: %d
pt_br: tipo de chave: %d

source: run with -a to use the obtained public key!
pt_br: rode o programa com a opção -a para utilizar a chave pública obtida!

source: trying to connect with obtained public key!
pt_br: tentando conectar com a chave pública obtida!

source: unknown key type: %d
pt_br: tipo de chave desconhecido: %d

source: redirecting to %s...
pt_br: redirecionando para %s...

source: error: redirect loop detected!
pt_br: erro: redirecionamento cíclico detectado!

source: error: too many redirections!
pt_br: erro: redirecionamentos demais!

source: Links found: %d
pt_br: Links encontrados: %d

source: Input link number (starts at 0) or control char ('?' or 'i'):
pt_br: Entre o número do link (começa em 0) ou caractere de controle ('?' ou 'i'):

source: Selected link: #%02d: %s
pt_br: Link selecionado: #%02d: %s

source: Bad number: %d
pt_br: Número ruim: %d

source: Input new link or path:
pt_br: Entre um novo link ou caminho:

source: Bad input!
pt_br: Entrada ruim!

source: Unsupported protocol!
pt_br: Protocolo não suportado!

source: Usage: meow [options] <file> send <file> in encrypted format
pt_br: Forma de uso: meow [opções] <arquivo> enviar <arquivo> de forma encriptada

source: Usage meowd [options] <url> receive encrypted file from <url>
pt_br: Forma de uso: meowd [opções] <url> receber arquivo encriptado de <url>

source: Usage: purr [options] <action> <file>|<url> action: s[end] | r[ecv]
pt_br: Forma de uso: purr [opções] <ação> <arquivo>|<url> acão: s[end] | r[ecv] (enviar ou receber)

source: %sOptions: -a <algo>: choose algorithm, none available -u <url>: URL to use for send functionality -p <port>: port to use for send -o <output_file>: use file instead of stdout -s: use settings for pastebin.stratumzero.date -n: don't strip HTTP header from response -e: encrypt content: limited to 128KiB files -d: debug -h: show this dialog Environment:
pt_br: %sOpções: -a <algo>: escolher algoritmo, nenhum disponível -u <url>: URL utilizada para envio -p <porta>: porta utilizada para envio -o <arquivo_de_saída>: utilize esse arquivo ao invés da saída padrão -s: utilizar configurações para pastebin.stratumzero.date -n: não esconder cabeçalho HTTP da resposta -e: encriptar conteúdo: limitado a aquivos de 128KiB -d: rodar em modo de debug -h: mostrar essa mensagem Ambiente:

source: couldn't open output stream
pt_br: não foi possível abrir stream de saída

source: couldn't open output file
pt_br: não foi possível abrir arquivo de saída

source: discarding url arg...
pt_br: descartando argumento de URL...

source: couldn't parse URL!
pt_br: não foi possível parsear a URL!

source: only supports HTTP and HTTPS for now!
pt_br: apenas suporta HTTP e HTTPS por enquanto!

source: error decoding url
pt_br: erro ao decodificar a URL

source: reading certs...
pt_br: lendo certificados...

source: couldn't open certs
pt_br: não foi possível abrir certificados

source: ALPN mismatch
pt_br: desencontro de ALPN

source: couldn't clean up received link
pt_br: não foi possível limpar o link recebido

source: might not have written all data
pt_br: pode ser que nem todos os dados tenham sido escritos

source: scheme is too long
pt_br: o nome de protocolo é longo demais

source: unknown protocol
pt_br: protocolo desconhecido

source: malformed URL
pt_br: URL mal formada

source: malformed KEY and/or IV input
pt_br: entrada de chave ou vetor de inicialização mal formada

source: unsupported addr result
pt_br: resultado de endereço não suportado

source: IP address
pt_br: endereço IP

source: couldn't open socket or find domain
pt_br: não foi possível abrir a socket ou achar o domínio

source: warning: empty input file...
pt_br: aviso: arquivo de entrada vazio...

source: wrote %lu bytes!
pt_br: escreveu %lu bytes!

source: warning: empty response...
pt_br: aviso: resposta vazia...

source: TLS: couldn't close SSL connection!
pt_br: TLS: não foi possível fechar a conexão SSL!

source: TLS: all good!
pt_br: TLS: tudo certo!

source: TLS: non-critical I/O error
pt_br: TLS: erro de I/O (entrada/saída) não crítico

source: TLS: BearSSL error: %d
pt_br: TLS: erro da biblioteca BearSSL: %d

source: socket closed without terminating ssl!
pt_br: socket fechada sem terminal ssl!

source: CA_CERT_SSL_FILE: certificates file, default is /etc/ssl/certs.pem
pt_br: CA_CERT_SSL_FILE: arquivo de certificados, padrão é /etc/ssl/certs.pem

source: X509 err code: %d
pt_br: código de erro X509: %d

source: non supported key
pt_br: chave não suportada
